# Напишите программу, которая найдёт произведение пар чисел списка. Парой считаем первый и последний элемент, второй и предпоследний и т.д.
# Пример:
# - [2, 3, 4, 5, 6] => [12, 15, 16];
# - [2, 3, 5, 6] => [12, 15]
a = [2, 3, 5, 6]

def product_pairs(list_):
    b=[]
    for i in range(int((len(list_)/2)+0.5)):
        b.append(list_[i]*list_[-i-1])
    return b
print(product_pairs(a))